<?php
/**
 * Created by PhpStorm.
 * User: dell
 * Date: 2020/4/29
 * Time: 15:12
 */

class AppConfig{
    public static $config=array(
        'TOKEN_OVER'=>false,//token是否存在过期
        'token_over_day'=>7,//token的过期时间，单位天
        'JWT_KEY'=>'jwt',//对token数据加密，解密的key


        'TEACHER_LEAVE_REQUIRE'=>2,//老师请假类型
        'LEAVE_TIME'=>18,//老师请假多少秒之内不能重复提交

        'PASSWORD_KEY'=>'encryptionPassword',//用户密码加密拼接的字符串

        'CHINESE_NAME'=>'/^([\xe4-\xe9][\x80-\xbf]{2}){2,4}$/',//对中国姓名的正则验证
        'CHECK_PASSWORD'=>'/^(\w*(?=\w*\d)(?=\w*[A-Za-z])\w*){8,16}$/',//正则表达式8-16位字符（英文/数字/符号）至少两种或下划线组合
        'CHINA_PHONE'=>'/^(0|86|17951)?(13[0-9]|15[012356789]|16[012356789]|17[0-9]|18[0-9]|19[0-9]|14[57])[0-9]{7,8}$/',//中国手机号验证正则
        //车牌的验证正则
        'LICENSE_PLATE'=>'/^([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}(([0-9]{5}[DF])|([DF]([A-HJ-NP-Z0-9])[0-9]{4})))|([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-HJ-NP-Z0-9]{4}[A-HJ-NP-Z0-9挂学警港澳]{1})$/',
    );
    /**
     * 阿里云短信服务平台的配置
     * @var array
     */
    public static $sms=array(
        'MOBILE_CODE_OVER_TIME'=>1800,//短信验证码的过期时间 单位秒
        'is_sms'=>1,//开启短信，1：开启，0：关闭
        'is_show'=>1,//如果遇发送失败时候，直接在前端显示阿里云返回来的失败原因（所有用户都能看到）
        'accessKeyId'=>'',//阿里云短信服务平台的KeyId
        'accessKeySecret'=>'',//阿里云短信服务平台的KeySecret
    );
    /**
     * 老师的配置信息
     * @var array
     */
    public static $teacher = array(
        'PERSONAL_CENTER'=>1,//是否展示教师的个人中心
        'LICENSE_PLATE'=>1,//是否展示教师的车牌
        'COURSE'=>3,//是否展示教师的课程和授课班级 1：只展示授课，2：只展示班级，3：两者都展示
    );

    public static $status = array(
        10001=>'SUCCESS',
        10101=>'没有找到该学校，请联系管理员！',
        10102=>'非法请求！',
        10103=>'token已过期，请从新登陆！',

        /**短信验证码 START**/
        100101=>'短信发送成功，请注意查收！',
        100104=>'短信验证码错误！',
        100105=>'短信验证码过期！',
        100106=>'发送失败,请联系管理员！',
        /**短信验证码 END**/

        /**登陆注册 START**/
        100106=>'出现未知原因，手机注册失败！',
        100107=>'该手机号已经注册，请换个手机号注册或者找回密码！',
        100108=>'密码不符合规则，必须是8-16位的英文数字和下划线的组合！',
        100109=>'手机号不正确，请从新输入！',
        100110=>'该手机号没有注册，请注册！',
        /**登陆注册 END**/

        /**学生预约试听的状态码 START**/
        10002=>'请选择试听的学校！',
        10003=>'请输入正确的中国姓名！',
        10004=>'请输入手机号码！',
        10005=>'今天你已经预约过了！',
        /**学生预约试听的状态码 END**/

        /**课程详情的状态码 START**/
        10006=>'没有找到该学校的信息！',
        /**课程详情的状态码 END**/

        /**添加学生信息 START**/
        10007=>'对不起，该学生已经存在！',
        10008=>'对不起，该学生已报名但未支付！',
        10009=>'对不起，本课程报名人数已满！',
        10010=>'对不起，本课程已经结束！',
        10011=>'报名成功,请前往个人中心查看!',
        /**添加学生信息 END**/

        /**学生报名申请 START**/
        10012=>'请填写学生名字！',
        10013=>'对不起，该学生已经是该校的学生了！',
        10014=>'对不起，该学生已经提交过报名申请了！',
        /**学生报名 END**/

        /**绑定学生身份 START**/
        10015=>'没有找到该生信息或者填写信息有误！',
        10016=>'该学生已经被绑定了！',
        /**绑定学生身份 END**/
    );

}